Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.Revision.Time Property
 Gets the revision time.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DateTime Time {
	get;
 }
Public ReadOnly Property Time As DateTime
		Get
Property Value
Type: DateTime
 The revision time.
See Also
Reference
ReferenceModel.Revision Structure
Tekla.Structures.Model Namespace